In [33]:
import pandas as pd

In [34]:
#KMeans 모델생성 함수
def model_kmeans(K):
    import pandas as pd
    from sklearn.cluster import KMeans
    kmeans = KMeans(n_clusters=K,random_state=0)

    dataset = pd.read_csv('data/KMeansData.csv')
    X=dataset.iloc[:,[0,1]].values 
    
    from sklearn.preprocessing import StandardScaler
    scaler = StandardScaler()
    X_trans = scaler.fit_transform(X)
    kmeans.fit(X_trans)

    centers_org = scaler.inverse_transform(kmeans.cluster_centers_)
    
    return kmeans, X, X_trans, centers_org

In [35]:
df_stu = pd.read_csv('data/학사관리/학생.csv')
df_stu.head()

       학생번호 학생이름 학생학과  학년      생년월일  지도교수
0  92414029  서연우   전산   3  73/10/06   228
1  92414033  김창덕   전산   4  73/10/26   221
2  92514009  이지행   전자   4  73/11/16   311
3  92514023  김형명   전자   4  73/08/29   311
4  92454018  이원구   건축   3  74/09/30   509

In [36]:
df_pro = pd.read_csv('data/학사관리/교수.csv')
df_pro

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [37]:
stu = list(df_stu['학생이름'])
pro = list(df_pro['교수이름'])
names = stu+pro
len(names)
print(names)

['서연우', '김창덕', '이지행', '김형명', '이원구', '이재영', '박혜경', '김수정', '홍길동', '이병렬', '이재광', '강승일', '오문환']

In [38]:
df = pd.read_csv('data/KMeansData.csv')
df['name']=''
df.head()

   hour  score name
0  7.33     73
1  3.71     55
2  3.43     55
3  3.06     89
4  3.33     79

In [39]:
import random
idx = random. randint(0, len(names)-1)
idx, names[idx]

(3, '김형명')

In [40]:
for i in range(len(df)):
    import random
    idx = random. randint(0, len(names)-1)
    df.loc[i, 'name'] = names[idx]

In [41]:
df.tail()

    hour  score name
95  6.21     56  오문환
96  7.76     84  홍길동
97  5.22     87  이지행
98  6.65     13  이병렬
99  2.46     30  서연우

In [45]:
kmeans, X, X_trans, centers_org = model_kmeans(4)
y_pred = kmeans.fit_predict(X_trans)
df['cluster'] = y_pred
df.tail()

    hour  score name  cluster
95  6.21     56  오문환        0
96  7.76     84  홍길동        1
97  5.22     87  이지행        0
98  6.65     13  이병렬        2
99  2.46     30  서연우        3

In [64]:
for i in range(4):
    filt = df['cluster']==i
    df2 = df[filt]
    print(f'{i}그룹{len(df2)}명................................')
    # names = df2['name']
    index = df2.index

    count=0
    for idx in index:
        print(f'{idx}:{df.loc[idx,"name"]}', end='')
        count +=1
        if count%10==0: print()
    print()
    print('-'*60)

0그룹26명................................
1:이원구3:김창덕4:김수정7:홍길동9:박혜경10:박혜경15:강승일19:김수정21:강승일33:김창덕
37:박혜경38:오문환39:강승일47:김수정51:이원구54:이재광55:강승일56:이재광57:김창덕67:이병렬
78:이병렬85:김수정90:박혜경92:이원구95:오문환97:이지행
------------------------------------------------------------
1그룹24명................................
0:이지행8:이지행17:오문환24:이병렬25:박혜경34:강승일35:김수정42:이지행45:김창덕50:김창덕
61:이병렬62:오문환63:김수정64:이원구69:이재광71:김형명72:이병렬73:이병렬79:이재광81:이재영
84:오문환88:김창덕93:이원구96:홍길동
------------------------------------------------------------
2그룹25명................................
5:김창덕6:서연우12:이지행16:이원구20:오문환23:이병렬30:이병렬31:이재광41:이재영46:김형명
48:이원구49:김수정52:이원구53:서연우59:이지행60:이원구65:김수정66:홍길동68:이병렬80:이지행
82:박혜경83:오문환87:서연우91:서연우98:이병렬
------------------------------------------------------------
3그룹25명................................
2:홍길동11:오문환13:박혜경14:이원구18:이병렬22:이지행26:강승일27:김창덕28:오문환29:김창덕
32:김수정36:홍길동40:이재광43:강승일44:김형명58:서연우70:이재광74:이원구75:박혜경76:김창덕
77:이원구86:김창덕89:김수정94:김수정99:서연우
------------------------------------------------------------